app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "updated article"], ["updated_at", "2018-06-25 06:47:08.897889"], ["id", 1]]
---
    def update
      @article = Article.find(params[:id])

      if @article.update(article_params)